---
kind: property
id: P:Autodesk.Revit.DB.ContourSettingItem.Step
source: html/0274557a-840f-2fce-ec8a-36008c6f0462.htm
---
# Autodesk.Revit.DB.ContourSettingItem.Step Property

The increment elevation of the contour range.

## Syntax (C#)
```csharp
public double Step { get; }
```